# Основы pandas

In [2]:
import pandas as pd

Пример забора данных с сайтов

In [3]:
pd.read_html('http://www.cbr.ru')

[  Курсы валют на 21.04.2020 на 22.04.2020
 0  Доллар США      74,6657₽      76,2562₽
 1        Евро      81,1019₽      82,6160₽]

In [4]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [5]:
df[:5]

[       Дата  Закрытие  Открытие  Максимум  Минимум
 0  21.04.20    771310    754464    776470   752760
 1  20.04.20    754550    740745    756329   740435
 2  19.04.20    740060    740650    740650   738240
 3  18.04.20    740750    740750    740750   740750
 4  17.04.20    740745    738110    744370   730810
 5  16.04.20    738160    749395    750500   737415
 6  15.04.20    749410    730495    753470   728520
 7  14.04.20    730230    736382    736395   727310
 8  13.04.20    736381    734500    737930   728745
 9  12.04.20    735935    738015    738015   734745,
        Имя  Unnamed: 1     %    курс                 Дата
 0  EUR/RUB         NaN -7393  833745  22.04.2020 12:06:00
 1  USD/RUB         NaN -5225   76728  22.04.2020 12:06:00
 2  CHF/RUB         NaN -4451  791945  22.04.2020 12:07:00
 3  JPY/RUB         NaN -3797    7134  22.04.2020 12:07:00
 4  GBP/RUB         NaN -1429  947348  22.04.2020 12:07:00
 5  NOK/RUB         NaN -3755   72213  22.04.2020 12:07:00
 6  AUD/RUB         NaN  4748  487221  22.04.2020 12:07:00
 7  NZD/RUB         NaN  1734  460571  22.04.2020 12:07:00
 8  TRY/RUB         NaN -5863  109927  22.04.2020 12:07:00]

Импорт данных из файла

In [6]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [7]:
data.tail()

          country  year  quantity  category
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [8]:
type(data)

pandas.core.frame.DataFrame

In [ ]:
# если надо указать свои заголовки и разделитель
# data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\t', header=0)
# data.head()

In [10]:
# количество строк в датафрейме

len(data)

1189482

In [9]:
# или так

data.shape

(1189482, 4)

Простые вычисления для нового столбца

In [ ]:
data['year_plus_one'] = data['year'] + 1
data.head()

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

In [18]:
data = pd.read_csv('transactions.csv')
data.head()
data.shape

(60, 8)

### Основные сведения о датафрейме

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 8 columns):
Year       60 non-null int64
Month      60 non-null int64
ID         60 non-null object
Product    60 non-null object
Amount     60 non-null int64
Price      60 non-null int64
Total      60 non-null int64
Cost       60 non-null int64
dtypes: int64(6), object(2)
memory usage: 3.9+ KB

In [23]:
# немного статистики

data.describe()
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

### Отдельный столбец (тип Series)

In [24]:
data['year'].head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [25]:
# или так

data.year.head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [26]:
type(data['year'])

pandas.core.series.Series

In [ ]:
data.head()

In [ ]:
# уникальные значения в столбце

data['category'].unique()

In [ ]:
len(data['category'].unique())

In [ ]:
data['category'].head()

In [ ]:
# распределение количества строк по значениям столбца

data['category'].value_counts().head(10)

In [ ]:
data['category'].value_counts(normalize=True).head()

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

In [31]:
data = pd.read_csv('transactions.csv')
data['Product'].value_counts()

_5    11
_8     8
_2     8
_3     7
_4     7
A5     5
A1     5
A4     5
A2     2
_6     2
Name: Product, dtype: int64

# Фильтры

In [32]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [33]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [34]:
# или так

data[['country', 'quantity']].head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

### Отфильтруем строки с потреблением выше среднего

In [39]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [40]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012965'

In [41]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query('quantity > {}'.format(average_level)).head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [ ]:
# самый популярный способ

data[ data.quantity > average_level ].head()

### Как определить используемый вариант названия страны?

In [ ]:
data['country'].unique()

In [ ]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('us', case=False) ]['country'].unique()

In [43]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [44]:
filtered_countries['country'].unique()

array(['Russian Federation', 'Belarus'], dtype=object)

In [ ]:
# фильтры на номер строки

data.loc[1000:1005]

# Сортировка

In [ ]:
# Сортировка по столбцу

data.sort_values(by='quantity').head()

In [ ]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

In [ ]:
# сортировка по нескольким столбцам

data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).head(50)

### Параметр inplace

In [ ]:
data.head()

In [ ]:
data.sort_values('country', ascending=True, inplace=rewrite)

In [ ]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?